<?php

// Task 08
// Напишите функцию f08, которая возвращает строку. Строка будучи выведена в консоль выглядит так:
/*

00_01_02_03_04_05_06_07_08_09_
10_11_12_13_14_15_16_17_18_19_
20_21_22_23_24_25_26_27_28_29_
30_31_32_33_34_35_36_37_38_39_
40_41_42_43_44_45_46_47_48_49_

*/
// Реализуйте вложенными циклами.

# write your code under this line

function f08(){
    $str = "";
    for ($k = 0; $k < 5; $k++){
        for ($i = 0; $i < 10; $i++){
            $str .= $k.$i."_";
        }
        $str .= "\n";
    }
    return $str;
}


$res = f08();
echo ($res);
